#ifndef ONCE_FATFS_FATFS_H
#define ONCE_FATFS_FATFS_H
////////////////////////////////////////////////////////////////////////////////
///@file fatfs.h
///@author MStar Semiconductor Inc.
///@brief
////////////////////////////////////////////////////////////////////////////////
#include <pkgconf_system.h>
#include <pkgconf_fs_fat.h>
#include <infra_type.h>
#include <io_io.h>
#include <fileio_fileio.h>
#include <efat_tree.h>
#include <efat_list.h>
#include <sys_types.h>
#include <sys_stat.h>
#include <dirent.h>
#include <fileio_fileio.h>
#include "sys_sys_isw_cli.h"
#include <string.h>
//for RTK
#include "sys_MsWrapper_cus_os_sem.h"
#include "sys_MsWrapper_cus_os_util.h"
#include "sys_MsWrapper_cus_os_timer.h"
#include "sys_traces.ho"
#include "cus_os.hc"
#include "sys_MsWrapper_cus_os_msg.h"
#include "hal_drv_api.h"
#include "newLS.h"

#define efat_dialog(fmt, args...)  //_TRACE((EFAT_DBG26, fmt, ##args))

#ifdef USE_RTK_CV
#define pthread_t                efat_thread
#define sem_t                    efat_sem_t
#define sem_init(a, b, c)       MsInitSem(a,c)//efat_semaphore_init(a, c)
#define sem_post                MsProduceSem//efat_semaphore_post
#define sem_wait                MsConsumeSem //efat_semaphore_wait
#define sem_destroy              efat_semaphore_destroy
#define pthread_create           efat_thread_create
#endif

/* ++ Port V107MMP ++ */
// undefine semaphore for test
#define efat_semaphore_init(a, b)       MsInitSem(*a, b)

#define O_FAST_1M         (2<<13)   	/* Fast Access Mode with 1 MB */
#define O_FAST_2M         (3<<13)   	/* Fast Access Mode with 2 MB */
#define O_FAST_4M         (4<<13)   	/* Fast Access Mode with 4 MB */
#if defined(FS_FAT_MERGE_CONTINUOUS_CLUSTERS)
#define O_CCW          (1<<16)   	/* Fast write mode for continuous clusters */
#define O_CCR          (1<<23)   	/* Fast write mode for continuous clusters */
#endif
#if defined(EFAT_DYNAMIC_MEMORY_MODE_CC)
#define O_FCC          (1<<17)      /* file cluster chain */
#endif
#define O_FAST_MODE  (O_FAST_512K | O_FAST_1M | O_FAST_2M | O_FAST_4M)   /* Fast Access Mode */
#define O_ALLOC_MODE_SHIFT 	18
#define O_ALLOC_1M         	(1<<O_ALLOC_MODE_SHIFT)   	/* Alloc 1 MB */
#define O_ALLOC_2M         	(2<<O_ALLOC_MODE_SHIFT)   	/* Alloc 2 MB */
#define O_ALLOC_4M         	(3<<O_ALLOC_MODE_SHIFT)   	/* Alloc 4 MB */
#define O_ALLOC_8M         	(4<<O_ALLOC_MODE_SHIFT)   	/* Alloc 8 MB */
#define O_ALLOC_16M        	(5<<O_ALLOC_MODE_SHIFT)   	/* Alloc 16 MB */
#define O_ALLOC_32M        	(6<<O_ALLOC_MODE_SHIFT)   	/* Alloc 32 MB */
#define O_ALLOC_MODE  (O_ALLOC_1M | O_ALLOC_2M | O_ALLOC_4M| O_ALLOC_8M| O_ALLOC_16M| O_ALLOC_32M)   /* ALLOC Mode */
// FAT filesystem dir entry attributes

#define S_FATFS_RDONLY  (0x01) // Read only
#define S_FATFS_HIDDEN  (0x02) // Hidden
#define S_FATFS_SYSTEM  (0x04) // System
#define S_FATFS_VOLUME  (0x08) // Volume label
#define S_FATFS_DIR     (0x10) // Subdirectory
#define S_FATFS_ARCHIVE (0x20) // Needs archiving

// Mode bits which are allowed to be changed by attrib
#define S_FATFS_ATTRIB   (S_FATFS_RDONLY | S_FATFS_HIDDEN | S_FATFS_SYSTEM | \
                          S_FATFS_ARCHIVE)

// -------------------------------------------------------------------------

// -------------------------------------------------------------------------
// FAT table entries types

#define TENTRY_REGULAR  0 // Used when entry points to next file cluster
#define TENTRY_FREE     1 // Free cluster
#define TENTRY_LAST     2 // Last cluster of file
#define TENTRY_RESERVED 3 // Reserved cluster
#define TENTRY_BAD      4 // Bad cluster

// mode FAT dir entry attributes macros

#define S_FATFS_ISRDONLY(__mode)  ((__mode) & S_FATFS_RDONLY)
#define S_FATFS_ISHIDDEN(__mode)  ((__mode) & S_FATFS_HIDDEN)
#define S_FATFS_ISSYSTEM(__mode)  ((__mode) & S_FATFS_SYSTEM)
#define S_FATFS_ISVOLUME(__mode)  ((__mode) & S_FATFS_VOLUME)
#define S_FATFS_ISDIR(__mode)     ((__mode) & S_FATFS_DIR)
#define S_FATFS_ISARCHIVE(__mode) ((__mode) & S_FATFS_ARCHIVE)

// -------------------------------------------------------------------------
//Compatibility with windows
//Support Resver Bit
#define S_FATFS_LOWCASE_EXTNAME    (0x10) //the extname is low case
#define S_FATFS_LOWCASE_FILENAME   (0x8)  //the file tname is low case

#define S_FATFS_ISLOWCASEEXTNAME(__rsv) (((__rsv))&S_FATFS_LOWCASE_EXTNAME)
#define S_FATFS_ISLOWCASEFILENAME(__rsv)(((__rsv))&S_FATFS_LOWCASE_FILENAME)



#if defined(FS_FAT_MERGE_CONTINUOUS_CLUSTERS)
typedef struct fatfs_rbffer
{
    efat_uint32 sector;          // start sector
    efat_uint32 sector_snum;     // the numer of toal sector
    efat_uint32 rbuffer_index;   // Position inside buffer
    efat_uint32 rbuffer_datalen; // size of buffer
    efat_uint32 rbuffer_size;    // data size
    efat_uint32 remnant_size;
    efat_int32  rbuffer_status;
    efat_uint8 * data;
} fatfs_rbffer;


extern fatfs_rbffer rbuffer[1];
#endif


#ifndef O_UNICODE
#define O_UNICODE         (1u <<31)
#endif

#define SEEK_EARSE_CLUSER_CL    (1u <<15)

//#define FATFS_MERGE_CONTINUOUS_CLUSTERS     1
#define FOR_MMI_REQUIRE 1



/* for FAT_COPY_BUFER in SRAM case */
#define SRAM_BSS    //__attribute__((section(".bss_sram")))
#if defined(HWR_HAL_MIPS_MSTAR_SDRAM_ENABLE)
#define SDRAM_FSBUF     //__attribute__((section(".fsbuf_sdram")))
/*It is temporary solution for M2's FileSystem to use SDRAM*/
#endif

//align to cache line (16 bytes)
#if defined(HWR_HAL_MIPS_MSTAR_PLATFORM_MONTAGE3)
#include <hal_var_cache.h>
#define ALIGN_CACHE_LINE(_x_) (((_x_) + (ARM_DCACHE_LINE_SIZE-1)) & ~(ARM_DCACHE_LINE_SIZE-1))
#endif


#if defined(HWR_HAL_MIPS_MSTAR_PLATFORM_MONTAGE3)
#define ALIGN_(p) ALIGN_CACHE_LINE(p)
#else
// Add at least one list header size.
#define ALIGNBYTES      (ARC_ALIGNMENT - 1)
#define ALIGN_(p)        (((unsigned)(p) + ALIGNBYTES) &~ ALIGNBYTES)
#endif
#define CACHE_BLOCK_SIZE     (4096)
#define CACHE_BLOCK_SIZE_TAB (4096)
#define CACHE_BLOCK_SIZE_DIR (4096)



#if defined(HWR_HAL_MIPS_MSTAR_PLATFORM_MONTAGE3)
//extern unsigned int FAT_COPY_BUFER[4][1024];
#endif
// --------------------------------------------------------------------------

#define FATFS_HASH_TABLE_SIZE NUM_FS_FAT_NODE_HASH_TABLE_SIZE

#define FATFS_NODE_POOL_SIZE  NUM_FS_FAT_NODE_POOL_SIZE

#ifdef DBG_FS_FAT_NODE_CACHE_EXTRA_CHECKS
# define FATFS_NODE_CACHE_EXTRA_CHECKS 1
#endif

#ifdef CFG_FS_FAT_LONG_FILE_NAMES
#define FAT_FILE_NAME_MAX   (NUM_FS_FAT_LONG_FILE_NAME_MAX+1)
#else
#define FAT_FILE_NAME_MAX   13
#endif



#if defined(FS_FAT_MERGE_CONTINUOUS_CLUSTERS)
#define BUF0_SIZE           (rbuffer[0].rbuffer_datalen)
#define BUF0_DATA_SIZE      (rbuffer[0].rbuffer_size)
#define BUF0_START_SECTOR   (rbuffer[0].sector)
#define BUF0_SECTOR_LEN     (rbuffer[0].sector_snum)
#define BUF0_INDEX          (rbuffer[0].rbuffer_index)
#define BUF0_REMNANT_SIZE   (rbuffer[0].remnant_size)
#define BUF0_DATA           (rbuffer[0].data)
#define BUF0_END_SECTOR     (BUF0_START_SECTOR + BUF0_SECTOR_LEN)
#define BUF0_OFFSET         (BUF0_DATA + BUF0_INDEX)
#define BUF0_STATUS         (rbuffer[0].rbuffer_status)
#endif

extern int efat_errno;
extern efat_uint8 gu8_chk_croslnk;
extern int 	unlink(const char *path);
extern int 	rmdir(const char *path);
extern int 	access(const char *path, int amode);
extern int 	chown(const char *path, uid_t owner, uid_t group);
extern long 	pathconf(const char *path, int name);
extern long 	fpathconf(int fd, int name);
extern int 	pipe(int fildes[2]);
extern int 	dup(int fd);
extern int 	dup2(int fd,int fd2);
extern int 	close(int fd);
extern ssize_t 	read(int fd, void *buf, size_t nbyte);
extern ssize_t 	write(int fd, const void *buf, size_t nbyte);
extern int  ftruncate( int fd, unsigned int size );
extern ll_off_t 	lseek(int fd, ll_off_t offset, int whence);
extern int      fsync( int fd );
extern int     syncall(void);
char * fdToMntName(int fd);
extern int syncByName(const utf16 *wpath);
extern int	wunlink(const utf16* path);
extern int	wopen( const utf16* /* path */, int /* oflag */, ... );
#if defined(ENABLE_CHECK_DISK)
int wopen_ex( const utf16 *wpath, int oflag, ... );
#endif
extern int	wrmdir(const utf16* path);
__externC int	wopen_fcc( const utf16 *wpath, int oflag,unsigned int * addr, unsigned int size, ... );
// --------------------------------------------------------------------------

#define PARTIAL_SYNC    1
#ifndef CFG_REDUCE_MEM_USAGE
#define AUTO_ALIGN 1
#endif
// --------------------------------------------------------------------------

struct fatfs_disk_s;
typedef struct fatfs_disk_s fatfs_disk_t;

// --------------------------------------------------------------------------
typedef enum {
    EXNAME_FIRST,
    EXNAME,
    DIRENT,
    DIREND,
    DELENTRY,
    VOLUME,

    SEARCHING = 0x10,
    MATCHING = 0x20,
    SHORTMATCH = 0x30

} fatfs_entry_type;

typedef enum fatfs_type_e
{
    FATFS_FAT12 = 0,
    FATFS_FAT16,
    FATFS_FAT32
} fatfs_type_t;


typedef enum rw_type_e
{
    TENTRY = 0,    //for FAT Table
    RAW_ENTRY,     //for Dir entry
    DENTRY,
#if defined(ENABLE_CHECK_DISK)
    T2ENTRY,
#endif
    DEFAULT_ENTRY
} rw_type_t;


typedef struct fatfs_data_pos_s
{
    efat_uint32 cluster;      // Cluster number
    efat_uint32 cluster_snum; // Cluster file seq number
                             // (0 - first cluster of file,
                             //  1 - second cluster of file, ...)
    efat_uint32 cluster_pos;  // Position inside cluster
} fatfs_data_pos_t;

typedef struct {
    struct efat_list_head  list_node; // list node
    struct ms_efat_node    ms_efat_node;   // red-black tree node
    efat_uint32        num;       // block number
/* ++ Port V107MMP ++ */
    efat_uint32        d_sector;  // only support 16K cache block
/* -- Port V107MMP -- */
    efat_uint32        flags;     // Flag word
    efat_bool          modified;  // is this block data modified (needs write)
    efat_uint8         *data;   // block data
} blib_block_t;

typedef struct {
    efat_uint32  n_gets;     // number of block gets
    efat_uint32  n_reads;    // number of block reads
    efat_uint32  n_writes;   // number of block writes
} efat_blib_stat_t;

typedef struct {
    struct efat_list_head      efat_list_head;       // head of block list
    struct ms_efat_root        ms_efat_root;         // block red-black tree root
    fatfs_disk_t          *disk;           // Pointer to disk object
    efat_uint32            block_size;      // block size
    efat_uint32            block_size_log2; // block size log2
    efat_uint8            *mem_base;        // memory base
    efat_uint32            mem_size;        // memory size
    struct efat_list_head      free_efat_list_head;  // list of free blocks
#ifdef IMP_BLOCK_LIB_STATISTICS
    efat_blib_stat_t       stat;            // statistics
#endif
#ifdef EFAT_FS_FAT_ENTRY_WRITE_RETRY
    efat_uint32            retry_cnt;       // write retry count
#endif
    efat_uint8             fat_table;
    efat_uint8             dir_table;
} efat_blib_t;

// -------------------------------------------------------------------------
// FAT dir entry structure

typedef struct fat_raw_dir_entry_s
{
    char       name[8+1];   // 00h : Name
    char       ext[3+1];    // 08h : Extension
    efat_uint8  attr;        // 0Bh : Attribute
    efat_uint8  nt_reserved; // 0Ch : Win NT Reserved field
    efat_uint8  crt_sec_100; // 0Dh : Creation time ms stamp 0 - 199
    efat_uint16 crt_time;    // 0Eh : Creation time
    efat_uint16 crt_date;    // 10h : Creation date
    efat_uint16 acc_date;    // 12h : Last access date
    efat_uint16 cluster_HI;  // 14h : Starting cluster HI WORD (FAT32)
    efat_uint16 wrt_time;    // 16h : Time
    efat_uint16 wrt_date;    // 18h : Date
    efat_uint16 cluster;     // 1Ah : Starting cluster
    efat_uint32 size;        // 1Ch : Size of the file

#ifdef CFG_FS_FAT_LONG_FILE_NAMES
    efat_uint8  id;          // 00h : Entry sequence number
    efat_uint16 extname[13]; // 01h : Extended file name fragment
    efat_uint8  alias_csum;  // 0Dh : Checksum of main dirent
#endif

} fat_raw_dir_entry_t;

typedef struct fatfs_dir_entry_s
 {
    char              filename[12+1]; // name of file
    mode_t            mode;           // Mode type
    size_t            size;           // Size of file (bytes)
    time_t            ctime;          // Create times
    time_t            atime;          // Last access times
    time_t            mtime;          // Last modify times
    efat_uint8         rsvd;           // Reserved
    efat_uint8         priv_data;      // Private data
    efat_uint32        cluster;        // 1st cluster number
    efat_uint32        parent_cluster; // 1st cluster of parent dentry
    fatfs_data_pos_t  disk_pos;       // Position of dir entry on disk
#ifdef CFG_FS_FAT_LONG_FILE_NAMES
    fatfs_data_pos_t  start_pos;      // Position of start of dir entry on disk
     int              extras;         // Number of extra dir entries
#endif
