///@file MenuSetting.h
//==============================================================================
//
//  File        : MenuSetting.h
//  Description : INCLUDE File for the Menu Setting function porting.
//  Author      :
//  Revision    : 1.0
//
//==============================================================================

#ifndef _MENUSETTING_H_
#define _MENUSETTING_H_

/*===========================================================================
 * Include file
 *===========================================================================*/
#if !defined(_BUILD_SDK_LIB_) && !defined(_NET_SDK_)
#include "Customer_config.h"
#endif

#include "ahc_audio.h"
#include "config_fw.h"

/*===========================================================================
 * Macro define
 *===========================================================================*/

#define MENU_DIR_KEY_NUM (4) //1:MENU_CIRCLE. 2:MENU_UP\MENU_DOWN. 4:MENU_UP\MENU_DOWN\MENU_LEFT\MENU_RIGHT


#define PQCONTRAST_CENTER                   (50)       //Range 0~100
#define PQBRIGHTNESS_CENTER                 (50)       //Range 0~100
#define PQSATURATION_CENTER                 (50)       //Range 0~99

#define PQCONTRAST_MIN                      (0)
#define PQCONTRAST_MAX                      (100)
#define PQCONTRAST_STEP                     (10)

#define PQBRIGHTNESS_MIN                    (0)
#define PQBRIGHTNESS_MAX                    (100)
#define PQBRIGHTNESS_STEP                   (10)

#define PQSATURATION_MIN                    (0)
#define PQSATURATION_MAX                    (99)
#define PQSATURATION_STEP                   (10)

/*===========================================================================
 * Structure define
 *===========================================================================*/
/* Don't Add new item anymore, if you want to do, please add new item in MENU_ATOMS */
typedef struct _MenuInfo
{
// Still
    UINT8 uiIMGSize;            // 0
    UINT8 uiIMGQuality;
    UINT8 uiIMGStabilize;
    UINT8 uiFlashMode;
    UINT8 uiFlashLevel;
    UINT8 uiRedEyeReduce;       // 5
    UINT8 uiSelfTimer;
    UINT8 uiBurstShot;
// Movie
    UINT8 uiMOVSize;
    UINT8 uiMOVQuality;
    UINT8 uiMOVStabilize;       // 10
    UINT8 uiSlowShutter;
    UINT8 uiMicSensitivity;
    UINT8 uiMOVPreRecord;
    UINT8 uiMOVClipTime;
    UINT8 uiMOVPowerOffTime;    // 15
    UINT8 uiMOVSoundRecord;
// Manual
    UINT8 uiScene ;
    UINT8 uiFocus;
    UINT8 uiFocusRange;
    UINT8 uiMetering;           // 20
    UINT8 uiEV;
    UINT8 uiISO;
    UINT8 uiWB;
    UINT8 uiColor;
    UINT8 uiEffect;             // 25
    UINT8 uiFaceTouch;
    UINT8 uiSmileDetect;
    UINT8 uiSmileSensitivity;
// Playback
    UINT8 uiSlideShowStart;
    UINT8 uiSlideShowFile;      // 30
    UINT8 uiSlideShowEffect;
    UINT8 uiSlideShowMusic;
    UINT8 uiVolume;
// Edit Tool
    UINT8 uiFileEdit;
// Media Tool
    UINT8 uiMediaSelect;        // 35
    UINT8 uiDisplayInfo;
// General
    UINT8 uiBeep;
    UINT8 uiLCDBrightness;
    UINT8 uiAutoPowerOff;
    UINT8 uiDateTimeSetup;      // 40
    UINT8 uiDateTimeFormat;
    UINT8 uiLanguage ;
    UINT8 uiTVSystem;
    UINT8 uiTVType;
    UINT8 uiHDMIOutput;         // 45
    UINT8 uiResetSetting;
// Battery
    UINT8 uiBatteryVoltage;
    UINT8 uiFlickerHz;
    UINT8 uiUSBFunction;
    UINT8 uiLCDRotate;          // 50
    UINT8 uiLCDPowerSave;
    UINT8 uiLEDFlash;
    UINT8 uiGsensorSensitivity;
    UINT8 uiTimeZone;               //Time zone: Time difference*4 based on GMT time in hour.
                                    //15 minutes per unit.
    UINT8 uiDateLogoStamp;      // 55
    UINT8 uiMotionDtcSensitivity;
    UINT8 uiVMDRecTime;
    UINT8 uiVMDShotNum;
    UINT8 uiBootUpMode;
    UINT8 uiTimeLapseTime;      // 60
    UINT8 uiAutoRec;
    UINT8 uiGPSStamp;
    UINT8 uiSpeedStamp;
    UINT8 uiRecordGPS;
    UINT8 uiImageUpsideDown;    // 65
    UINT8 uiHDR; //adding for HDR function
    UINT8 uiWDR;
    UINT8 uiStatusLight;
    UINT8 uiWNR;
    /* For CarDV
     * Please DON'T add or insert any member into the struct any more,
     * New require, please add in MENU_ATOMS menu_atoms (HCarDV_MenuSetting.c)
     */
} MenuInfo, *pMenuInfo;

/* Below SystemInfo is used for run time */
typedef struct _SystemInfo
{
// Still


// Movie
    UINT8 byStartNormalRecordAfterEmergencyRecord;

// Playback
    UINT8 byPlaybackVideoType;              // Video playback type, ex: Normal, Parking or Emergency videos


// Edit Tool


// Media Tool
    UINT8 byNeedToFormatMediaAsFormatFree;

// General
    UINT8 bSysBootUpMode;

}SystemInfo, *pSystemInfo;


/*===========================================================================
 * Enum define
 *===========================================================================*/

typedef enum {
    SYS_BOOTUP_MODE_NORMAL = 0 ,	//normal
